(package! ox-pandoc) ; export to multiple formats
(package! rg)

; org
(package! org-fancy-priorities)
(package! org-roam-server :disable t) ; not yet supported for roam v2

; orb
(package! org-roam-bibtex)
(package! bibtex-completion) ; required by helm|ivy-bibtex
(package! org-ref)
(package! helm-bibtex)

(package! plantuml-mode)
